/*
File:a23f3.c
   Να γραφεί πρόγραμμα το οποίο ζητά από τον χρήστη έναν θετικό ακέραιο (int) (> 0) 
    και έπειτα αν ο ακέραιος είναι άρτιος (ζυγός) εμφανίζει στην οθόνη την αύξουσα ακολουθία του αριθμού 
    από το 0 με βήμα 2, ενώ αν ο ακέραιος είναι περιττός (μονός) εμφανίζει στην οθόνη την αύξουσα ακολουθία
    του αριθμού από το 1 με βήμα 2.
   Θεωρείστε ότι ο χρήστης θα δώσει πάντα ένα θετικό ακέραιο (δεν απαιτείται έλεγχος).
*/
#include <stdio.h>
#include "genlib.h"
#include "simpio.h"
#include <math.h>

int main(){
 /*Δήλωση-Αρχικοποίηση μεταβλητών*/
 int k,i;
 /*Εισαγωγή δεδομένων*/
 printf("Enter number:");
 k=GetInteger();
 /*Υπολογισμοί & Εκτύπωση αποτελεσμάτων*/
 if(k%2==0){
    for(i=0;i<=k;i+=2){ /* Έλεγχος εάν είναι άρτιος */
            printf("%d ",i);}
 }else{
   for(i=1;i<=k;i+=2){
    printf("%d ",i);}
 }
 return 0;
}
