/*
File name:a21f5.c

*--------------------------------------------

    Να γραφεί ένα πρόγραμμα το οποίο να διαβάζει 5 πραγματικούς αριθμούς τύπου double και να τους αποθηκεύει σε έναν πίνακα.
    Το πρόγραμμα να υπολογίζει την απόσταση μεταξύ διαδοχικών στοιχείων του πίνακα και την αποθηκεύει σε ένα νέο πίνακα
    (θα καθορίσετε εσείς το απαιτούμενο μέγεθος). Η απόσταση προκύπτει ως η απόλυτη τιμή της διαφοράς των στοιχείων (συνάρτηση fabs).
    Για παράδειγμα, αν τα τέσσερα πρώτα στοιχεία του πίνακα είναι: 5.2, -3.2, 7.5, 12.22, οι αντίστοιχες αποστάσεις είναι:
    |-3.2-5.2| = 8.4, |7.5-(-3.2)| = 10.7 και |12.22-7.5| = 4.72.
    Το πρόγραμμα θα εμφανίζει στο τέλος τον αρχικό πίνακα που εισήγαγε ο χρήστης, σε μια γραμμή καθώς και τον πίνακα διαφορών
    σύμφωνα με την εκτέλεση που παρουσιάζεται. Κάθε στοιχείο των πινάκων θα εμφανίζεται με ακρίβεια 2 δεκαδικών ψηφίων.
*/
#include <stdio.h>
#include "genlib.h"
#include "simpio.h"
#include <math.h>

#define R 5 //cities

int main(){
double P[R],DIAF[R-1];
int i;
for (i=0;i<R;i++){
    printf("Enter number (%d):",i);
    P[i]=GetReal();
}
 for(i=0;i<R-1;i++){
   DIAF[i]=fabs(P[i+1]-P[i]);
 }
 for(i=0;i<R;i++){
    printf("%.2f ",P[i]);
 }
 printf("\n");
for(i=0;i<R-1;i++){
    printf("%.2f ",DIAF[i]);
}
return 0;}
