/*
File name:a29f4.c

*-----------------------------

 Υλοποιείστε τις αντίστοιχες συναρτήσεις στην γλώσσα C των ακόλουθων μαθηματικών ορισμών:
   • Ο μέγιστος κοινός διαιρέτης (gdc) δύο μη αρνητικών ακεραίων δίνεται από τον ακόλουθο αναδρομικό ορισμό:
	      gcd (a , b)= a , εάν b=0
	      gcd (a , b)= gcd ( b , a % b), αλλιώς
   • Δυο ακέραιοι αριθμοί λέγονται σχετικά πρώτοι (coprime) αν ο μέγιστος κοινός διαιρέτης τους είναι το 1.
   • Η συνάρτηση φ του Euler (phi) ενός θετικού ακεραίου Ν είναι το πλήθος των θετικών ακεραίων αριθμών μικρότερων
   ή ίσων του Ν, οι οποίοι είναι σχετικά πρώτοι με το Ν (δηλαδή οι ακέραιοι Κ με 1 <= Κ <= Ν).
   Να υλοποιήσετε ένα πρόγραμμα σε C, το οποίο ζητά από τον χρήστη ένα ακέραιο Χ και εμφανίζει τις τιμές της συνάρτησης φ
   του Euler από το 1 μέχρι και τον αριθμό X. Θεωρείστε ότι ο χρήστης δίνει πάντα αριθμό μεγαλύτερο ή ίσο του 1 - δεν απαιτείται έλεγχος.
   Η εμφάνιση των μηνυμάτων θα γίνεται μέσω του κυρίως προγράμματος (συνάρτηση main(), δηλαδή η εντολή εμφάνισης των μηνυμάτων (printf)
   θα είναι στην main()).
*/
#include <stdio.h>
#include "genlib.h"
#include "simpio.h"
#include <math.h>

  int gcd(int k,int X );
  int phi(int i);

 int main(){
 int X,i;
 printf("Enter X:");
 X=GetInteger();
 for(i=1;i<=X;++i){
    printf("phi(%d)=%d\n",i,phi(i));
 }
 return 0;}

 int phi(int i){
 int k,s;
 s=0;
  for(k=1;k<=i;++k){
    if(gcd(k,i)==1)
        s+=1;
  }
 return s;}

int gcd(int k,int i){
int n,mkd;
 for(n=1;n<=k && n<=i;++n){
    if(k%n==0 && i%n==0)
        mkd=n;
 }
return mkd;}
