/*
File name:a16f7.c

*--------------------------------

    Να γραφεί ένα πρόγραμμα το οποίο θα δέχεται ένα αλφαριθμητικό μέχρι 99 χαρακτήρες
    (θα δηλώσετε ένα πίνακα 100 χαρακτήρων) και να εμφανίζει τα ψηφία που περιέχονται
    μέσα στο αλφαριθμητικό και το άθροισμά τους, όπως φαίνεται στα παραδείγματα που ακολουθούν.
    Αν δεν υπάρχει ψηφίο, τότε εμφανίζεται το μήνυμα "No digits in input".
*/
#include <stdio.h>
#include <string.h>
#include <ctype.h>
#include "simpio.h"

#define N 100 /* Σταθερά για πίνακα 100 χαρακτήρων */

void checkDigit(char A[]);

int main(){
/* Δήλωση και αρχικοποίηση μεταβλητών */
char A[N];
 /* Εισαγωγή δεδομένων */
  printf("Insert a string: ");
  //	fgets(table, N, stdin); /* Δουλεύει μια χαρά αλλά δεν την έχουμε δει στο μάθημα */
  gets(A); /* Με την gets "χτυπάει" ο compiler ενώ με την fgets είναι μια χαρά.*/
  /*Κλήση συνάρτησης checkDigit για έλεγχο ύπαρξης ψηφίων*/
  checkDigit(A);
 return 0;
}


void checkDigit(char A[]){
  int i,j=-1,s=-8;
   for(i=0;i<N;i++){
    if(A[i]>='0' && A[i]<='9'){/* Ελέγχω εάν ο χαρακτήρας του πίνακα είναι ψηφίο (γίνεται και με το isdigit) */
     s+=(A[i]-48);/* Αφού το μετατρέψω σε αριθμό, το προσθέτω στον αθροιστή */
     j+=1;
      if(j==0 && A[i]!='8'){
        printf("%d",A[i]-48);/*Εκτυπώνει τον αριθμό*/
      }else{
        if(A[i]!= '8'){
         printf(" + %d",A[i]-48);/*Εκτυπώνει τον προτελευταίο αριθμό*/
        }
      }
    }
   }
   if(j==-1 || j==0){
    printf("No digits in input. \n");/* Εάν δεν έχει κανένα ψηφίο, τότε εκτυπώνει το μήνυμα */
   }else{
    printf(" = %d \n",s);/*Εκτυπώνει τον αθροιστή των αριθμών*/
   }
}
